{"timestamp":1736295107,"items":[{"title":"NIH Researchers Discover Novel Class of Anti-Malaria Antibodies","description":"January 3, 2025 -- A novel class of antibodies that binds to a previously untargeted portion of the malaria parasite could lead to new prevention methods, according to a study from researchers at the National Institutes of Health (NIH) published...","link":"https:\/\/www.drugs.com\/clinical_trials\/nih-researchers-discover-novel-class-anti-malaria-antibodies-21853.html","pubDate":"Fri, 03 Jan 2025 22:01:28 +0000","feedLabel":"Clinical Trials"},{"title":"Capricor Therapeutics Completes Submission of Biologics License Application to the U.S. FDA for Deramiocel for the Treatment of Duchenne Muscular Dystrophy","description":"SAN DIEGO, Jan. 02, 2025 (GLOBE NEWSWIRE) -- Capricor Therapeutics (NASDAQ: CAPR), a biotechnology company developing transformative cell and exosome-based therapeutics for the treatment of rare diseases, today announced the completion of the...","link":"https:\/\/www.drugs.com\/nda\/deramiocel_250102.html","pubDate":"Thu, 02 Jan 2025 22:01:49 +0000","feedLabel":"New Drug Applications"},{"title":"Verastem Oncology Announces FDA Acceptance and Priority Review of New Drug Application for Avutometinib in Combination with Defactinib for the Treatment of Recurrent KRAS Mutant Low-Grade Serous Ovarian Cancer","description":"BOSTON--(BUSINESS WIRE)--Dec. 30, 2024-- Verastem Oncology (Nasdaq: VSTM), a biopharmaceutical company committed to advancing new medicines for patients with cancer, today announced that the U.S. Food and Drug Administration (FDA) has accepted for...","link":"https:\/\/www.drugs.com\/nda\/avutometinib_241230.html","pubDate":"Mon, 30 Dec 2024 23:12:09 +0000","feedLabel":"New Drug Applications"},{"title":"Axsome Therapeutics Announces Successful Completion and Results of Phase 3 Clinical Program of AXS-05 in Alzheimer’s Disease Agitation","description":"NEW YORK, Dec. 30, 2024 (GLOBE NEWSWIRE) -- Axsome Therapeutics, Inc. (NASDAQ: AXSM), a biopharmaceutical company developing and delivering novel therapies for the management of central nervous system (CNS) disorders, today announced the successful...","link":"https:\/\/www.drugs.com\/clinical_trials\/axsome-therapeutics-announces-successful-completion-results-phase-3-clinical-program-axs-05-21852.html","pubDate":"Mon, 30 Dec 2024 22:01:06 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Approves Opdivo Qvantig (nivolumab and hyaluronidase-nvhy) Subcutaneous Injection for Use in Most Previously Approved Solid Tumor Opdivo (nivolumab) Indications","description":"PRINCETON, N.J.--(BUSINESS WIRE) December 27, 2024 --  Bristol Myers Squibb (NYSE: BMY) today announced that the U.S. Food and Drug Administration (FDA) granted approval for Opdivo Qvantig (nivolumab and hyaluronidase-nvhy) injection for...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-opdivo-qvantig-nivolumab-hyaluronidase-nvhy-subcutaneous-most-previously-approved-6431.html","pubDate":"Fri, 27 Dec 2024 02:12:40 +0000","feedLabel":"New Drug Approvals"},{"title":"Tevimbra Approved in U.S. for First-line Treatment of Gastric and Gastroesophageal Junction Cancers in Combination with Chemotherapy","description":"SAN MATEO, Calif.--(BUSINESS WIRE)-- December 27, 2024 -- BeiGene, Ltd. (NASDAQ: BGNE; HKEX: 06160; SSE: 688235), a global oncology company that intends to change its name to BeOne Medicines Ltd., today announced the U.S. Food and Drug...","link":"https:\/\/www.drugs.com\/newdrugs\/tevimbra-approved-u-s-first-line-gastric-gastroesophageal-junction-cancers-combination-chemotherapy-6429.html","pubDate":"Fri, 27 Dec 2024 01:12:53 +0000","feedLabel":"New Drug Approvals"},{"title":"Tonix Pharmaceuticals Announces PDUFA Goal Date of August 15, 2025, for FDA Decision on U.S. Marketing Approval for TNX-102 SL for Fibromyalgia","description":"CHATHAM, N.J., Dec. 23, 2024 (GLOBE NEWSWIRE) -- Tonix Pharmaceuticals Holding Corp. (Nasdaq: TNXP) (Tonix or the Company) today announced that the U.S. Food and Drug Administration (FDA) assigned a Prescription Drug User Fee Act (PDUFA) goal date...","link":"https:\/\/www.drugs.com\/nda\/tnx_102_241223.html","pubDate":"Mon, 23 Dec 2024 00:12:53 +0000","feedLabel":"New Drug Applications"},{"title":"Sumitomo Pharma America Announces U.S. FDA Approval of Gemtesa (vibegron) for Men with Overactive Bladder Symptoms Receiving Pharmacological Therapy for Benign Prostatic Hyperplasia","description":"MARLBOROUGH, Mass., Dec. 23, 2024 \/PRNewswire\/ -- Sumitomo Pharma America, Inc. (SMPA) announced today that the U.S. Food and Drug Administration (FDA) has approved Gemtesa (vibegron), a beta-3 (&beta;3) adrenergic receptor agonist, dosed once-daily...","link":"https:\/\/www.drugs.com\/newdrugs\/sumitomo-pharma-america-announces-u-s-fda-approval-gemtesa-vibegron-men-overactive-bladder-6433.html","pubDate":"Mon, 23 Dec 2024 00:12:39 +0000","feedLabel":"New Drug Approvals"},{"title":"CagriSema Demonstrates Superior Weight Loss in Adults with Obesity or Overweight in the REDEFINE 1 Trial","description":"Bagsv&aelig;rd, Denmark, 20 December 2024 &ndash; Novo Nordisk today announced headline results from REDEFINE 1, a phase 3 trial in the global REDEFINE programme. REDEFINE 1 is a 68-week efficacy and safety trial investigating subcutaneous CagriSema...","link":"https:\/\/www.drugs.com\/clinical_trials\/cagrisema-demonstrates-superior-weight-loss-adults-obesity-overweight-redefine-1-trial-21844.html","pubDate":"Fri, 20 Dec 2024 20:12:09 +0000","feedLabel":"Clinical Trials"},{"title":"Lexicon Announces Receipt of Complete Response Letter for Zynquista (sotagliflozin)","description":"THE WOODLANDS, TEXAS, DEC. 20, 2024 &mdash; Lexicon Pharmaceuticals, Inc. (Nasdaq: LXRX) today announced it has received a complete response letter (CRL) from the U.S. Food and Drug Administration (FDA) regarding the New Drug Application (NDA) for...","link":"https:\/\/www.drugs.com\/nda\/zynquista_241220.html","pubDate":"Fri, 20 Dec 2024 19:12:02 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Approves Alyftrek (vanzacaftor\/tezacaftor\/deutivacaftor) for the Treatment of Cystic Fibrosis","description":"BOSTON--(BUSINESS WIRE)--Dec. 20, 2024-- Vertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced that the U.S. Food and Drug Administration (FDA) has approved Alyftrek (vanzacaftor\/tezacaftor\/deutivacaftor), a once-daily next-in-class...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-alyftrek-vanzacaftor-tezacaftor-deutivacaftor-cystic-fibrosis-6427.html","pubDate":"Fri, 20 Dec 2024 03:12:56 +0000","feedLabel":"New Drug Approvals"},{"title":"U.S. FDA Approves Pfizer’s Braftovi Combination Regimen as First-Line Treatment of BRAF V600E-Mutant Metastatic Colorectal Cancer","description":"NEW YORK--(BUSINESS WIRE) December 20, 2024 -- Pfizer Inc. (NYSE: PFE) today announced that the U.S. Food and Drug Administration (FDA) has approved Braftovi (encorafenib) in combination with cetuximab (marketed as Erbitux&reg; ) and mFOLFOX6...","link":"https:\/\/www.drugs.com\/newdrugs\/u-s-fda-approves-pfizer-s-braftovi-combination-regimen-first-line-braf-v600e-mutant-metastatic-6426.html","pubDate":"Fri, 20 Dec 2024 02:12:19 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Zepbound (tirzepatide) as the First and Only Prescription Medicine for Moderate-to-Severe Obstructive Sleep Apnea in Adults with Obesity","description":"INDIANAPOLIS, Dec. 20, 2024 \/PRNewswire\/ -- Eli Lilly and Company (NYSE: LLY) today announced the U.S. Food and Drug Administration (FDA) approved Zepbound (tirzepatide) as the first and only prescription medicine for adults with moderate-to-severe...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-zepbound-tirzepatide-first-only-medicine-moderate-severe-obstructive-sleep-apnea-6425.html","pubDate":"Fri, 20 Dec 2024 02:12:06 +0000","feedLabel":"New Drug Approvals"},{"title":"Vertex Announces U.S. FDA Approval for Trikafta (elexacaftor\/tezacaftor\/ivacaftor and ivacaftor) to Include Additional Non-F508del Trikafta-Responsive Variants","description":"BOSTON--(BUSINESS WIRE)--Dec. 20, 2024-- Vertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced the U.S. Food and Drug Administration (FDA) has approved the expanded use of Trikafta (elexacaftor\/tezacaftor\/ivacaftor and ivacaftor) for...","link":"https:\/\/www.drugs.com\/newdrugs\/vertex-announces-u-s-fda-approval-trikafta-elexacaftor-tezacaftor-ivacaftor-ivacaftor-include-6430.html","pubDate":"Fri, 20 Dec 2024 01:12:50 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Alhemo (concizumab-mtci) to Prevent or Reduce Bleeding Episodes in People with Hemophilia A or B with Inhibitors","description":"PLAINSBORO, N.J., Dec. 20, 2024 \/PRNewswire\/ -- Novo Nordisk announced today that the U.S. Food and Drug Administration (FDA) approved Alhemo (concizumab-mtci) injection as a once-daily prophylaxis to prevent or reduce the frequency of bleeding...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-alhemo-concizumab-mtci-prevent-reduce-bleeding-episodes-hemophilia-b-inhibitors-6424.html","pubDate":"Fri, 20 Dec 2024 01:12:02 +0000","feedLabel":"New Drug Approvals"},{"title":"Rhythm Pharmaceuticals Announces FDA Approval of Imcivree (setmelanotide) for Patients as Young as 2 Years Old","description":"BOSTON, Dec. 20, 2024 (GLOBE NEWSWIRE) -- Rhythm Pharmaceuticals, Inc. (Nasdaq: RYTM), a commercial-stage biopharmaceutical company focused on transforming the lives of patients living with rare neuroendocrine diseases, today announced that the U.S...","link":"https:\/\/www.drugs.com\/newdrugs\/rhythm-pharmaceuticals-announces-fda-approval-imcivree-setmelanotide-patients-young-2-years-old-6432.html","pubDate":"Fri, 20 Dec 2024 00:12:58 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Tryngolza (olezarsen) to Reduce Triglycerides in Adults with Familial Chylomicronemia Syndrome","description":"CARLSBAD, Calif., Dec. 19, 2024 \/PRNewswire\/ -- Ionis Pharmaceuticals, Inc. (Nasdaq: IONS) announced today that the U.S. Food and Drug Administration (FDA) has approved Tryngolza (olezarsen) as an adjunct to diet to reduce triglycerides in adults...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-tryngolza-olezarsen-reduce-triglycerides-adults-familial-chylomicronemia-syndrome-6423.html","pubDate":"Thu, 19 Dec 2024 02:12:37 +0000","feedLabel":"New Drug Approvals"},{"title":"U.S. Food and Drug Administration Issues Complete Response Letter for the Glepaglutide New Drug Application for the Treatment of Short Bowel Syndrome","description":"Copenhagen, Denmark, December 19, 2024 &ndash; Zealand Pharma A\/S (Nasdaq: ZEAL) (&ldquo;Zealand&rdquo;) (CVR-no. 20045078), a biotechnology company focused on the discovery and development of innovative peptide-based medicines, today announced that...","link":"https:\/\/www.drugs.com\/nda\/glepaglutide_241219.html","pubDate":"Thu, 19 Dec 2024 02:12:06 +0000","feedLabel":"New Drug Applications"},{"title":"LimmaTech Awarded FDA Fast Track Designation for Vaccine Candidate Against Staphylococcus aureus","description":"SCHLIEREN, Switzerland--(BUSINESS WIRE)-- December 19, 2024 LimmaTech Biologics AG, a clinical-stage biotech company developing vaccines for the prevention of life-threatening diseases, announced today that the U.S. Food and Drug Administration...","link":"https:\/\/www.drugs.com\/clinical_trials\/limmatech-awarded-fda-fast-track-designation-vaccine-candidate-against-staphylococcus-aureus-21851.html","pubDate":"Thu, 19 Dec 2024 01:12:39 +0000","feedLabel":"Clinical Trials"},{"title":"Vertex Announces Results From Phase 2 Study of Suzetrigine for the Treatment of Painful Lumbosacral Radiculopathy","description":"BOSTON--(BUSINESS WIRE)--Dec. 19, 2024-- Vertex Pharmaceuticals Incorporated (Nasdaq: VRTX) today announced results from its Phase 2 study of suzetrigine, an investigational, oral, highly selective NaV1.8 pain signal inhibitor in people with painful...","link":"https:\/\/www.drugs.com\/clinical_trials\/vertex-announces-results-phase-2-study-suzetrigine-painful-lumbosacral-radiculopathy-21849.html","pubDate":"Thu, 19 Dec 2024 01:12:30 +0000","feedLabel":"Clinical Trials"},{"title":"Nurix Therapeutics Receives U.S. FDA Fast Track Designation for NX-5948 for the Treatment of Relapsed or Refractory Waldenstrom’s Macroglobulinemia","description":"SAN FRANCISCO, Dec. 19, 2024 (GLOBE NEWSWIRE) -- Nurix Therapeutics, Inc. (Nasdaq: NRIX), a clinical stage biopharmaceutical company developing targeted protein modulation drugs designed to treat patients with cancer and...","link":"https:\/\/www.drugs.com\/clinical_trials\/nurix-therapeutics-receives-u-s-fda-fast-track-designation-nx-5948-relapsed-refractory-waldenstrom-21840.html","pubDate":"Thu, 19 Dec 2024 01:12:09 +0000","feedLabel":"Clinical Trials"},{"title":"Sapience Therapeutics Receives FDA Orphan Drug Designation for ST316, a First-in-Class β-catenin Antagonist, for the Treatment of Familial Adenomatous Polyposis (FAP)","description":"TARRYTOWN, N.Y., December 19, 2024 &ndash; Sapience Therapeutics, Inc., a clinical-stage biotechnology company focused on the discovery and development of peptide therapeutics to address oncogenic and immune dysregulation that drive cancer...","link":"https:\/\/www.drugs.com\/clinical_trials\/sapience-therapeutics-receives-fda-orphan-designation-st316-first-class-catenin-antagonist-familial-21841.html","pubDate":"Thu, 19 Dec 2024 01:12:05 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Approves Symvess (acellular tissue engineered vessel-tyod) for the Treatment of Extremity Vascular Trauma","description":"DURHAM, N.C., Dec. 19, 2024 (GLOBE NEWSWIRE) -- Humacyte, Inc. (Nasdaq: HUMA), a biotechnology platform company developing universally implantable, bioengineered human tissues at commercial scale, today announced that the U.S. Food and Drug...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-symvess-acellular-tissue-engineered-vessel-tyod-extremity-vascular-trauma-6434.html","pubDate":"Thu, 19 Dec 2024 00:12:57 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Ryoncil (remestemcel-L-rknd) Mesenchymal Stromal Cell Therapy for Steroid-Refractory Acute Graft Versus Host Disease","description":"NEW YORK, Dec. 18, 2024 (GLOBE NEWSWIRE) -- Mesoblast Limited (Nasdaq:MESO; ASX:MSB), global leader in allogeneic cellular medicines for inflammatory diseases, today announced the Food and Drug Administration (FDA) approved Ryoncil (remestemcel-L)...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-ryoncil-remestemcel-l-rknd-mesenchymal-stromal-cell-therapy-steroid-refractory-acute-6421.html","pubDate":"Wed, 18 Dec 2024 23:12:47 +0000","feedLabel":"New Drug Approvals"},{"title":"Genentech’s Phase IIb Study of Prasinezumab Missed Primary Endpoint, but Suggests Possible Benefit in Early-Stage Parkinson’s Disease","description":"South San Francisco, CA -- December 18, 2024 -- Genentech, a member of the Roche Group (SIX: RO, ROG; OTCQX: RHHBY) announced today results from the Phase IIb PADOVA study investigating prasinezumab in 586 people with early-stage Parkinson&rsquo;s...","link":"https:\/\/www.drugs.com\/clinical_trials\/genentech-s-phase-iib-study-prasinezumab-missed-primary-endpoint-but-suggests-possible-benefit-21843.html","pubDate":"Wed, 18 Dec 2024 02:12:19 +0000","feedLabel":"Clinical Trials"},{"title":"Pila Pharma Announces XEN-D0501 Preclinical Proof-of-Concept Achieved In Cardiovascular Disease Study","description":"Malm&ouml;, Sweden 18 December 2024 PILA PHARMA AB (publ) (&ldquo;PILA PHARMA&rdquo; or the &ldquo;Company&rdquo;) today announces the completion of the study of the Research Group of Professor Dick W&aring;gs&auml;ter, Uppsala University, Sweden...","link":"https:\/\/www.drugs.com\/clinical_trials\/pila-pharma-announces-xen-d0501-preclinical-proof-concept-achieved-cardiovascular-study-21850.html","pubDate":"Wed, 18 Dec 2024 01:12:55 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Approves Ensacove (ensartinib) for ALK-Positive Locally Advanced or Metastatic Non-Small Cell Lung Cancer","description":"On December 18, 2024, the Food and Drug Administration approved ensartinib (Ensacove, Xcovery Holdings, Inc.) for adult patients with anaplastic lymphoma kinase (ALK)-positive locally advanced or metastatic non-small cell lung cancer (NSCLC) who...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-ensacove-ensartinib-alk-positive-locally-advanced-metastatic-non-small-cell-lung-cancer-6422.html","pubDate":"Wed, 18 Dec 2024 00:12:55 +0000","feedLabel":"New Drug Approvals"},{"title":"Reported Use of Most Drugs Among Adolescents Remained Low in 2024","description":"December 17, 2024 -- New NIH-funded data show lower use of most substances continues following the COVID-19 pandemic.\n\nIf you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat at 988lifeline.org. To learn...","link":"https:\/\/www.drugs.com\/clinical_trials\/reported-most-among-adolescents-remained-low-2024-21839.html","pubDate":"Tue, 17 Dec 2024 22:12:44 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Approves Steqeyma (ustekinumab-stba), a Biosimilar to Stelara","description":"JERSEY CITY, N.J., Dec. 17, 2024 -- Celltrion announced today that the U.S. Food and Drug Administration (FDA) has approved Steqeyma (ustekinumab-stba), a biosimilar to Stelara (ustekinumab), for subcutaneous injection or intravenous infusion in...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-steqeyma-ustekinumab-stba-biosimilar-stelara-6420.html","pubDate":"Tue, 17 Dec 2024 06:12:47 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Grants Fast Track Designation to Lipocine for LPCN 1148 as a Treatment for Sarcopenia in Patients with Decompensated Cirrhosis","description":"SALT LAKE CITY, Dec. 17, 2024 \/PRNewswire\/ -- Lipocine Inc. (NASDAQ: LPCN), a biopharmaceutical company leveraging its proprietary technology platform to augment therapeutics through effective oral delivery, today announced that the U.S. Food and...","link":"https:\/\/www.drugs.com\/clinical_trials\/fda-grants-fast-track-designation-lipocine-lpcn-1148-sarcopenia-patients-decompensated-cirrhosis-21837.html","pubDate":"Tue, 17 Dec 2024 01:12:26 +0000","feedLabel":"Clinical Trials"},{"title":"Tonix Pharmaceuticals Announces FDA Acceptance of the New Drug Application (NDA) for TNX-102 SL for Fibromyalgia","description":"CHATHAM, N.J., Dec. 17, 2024 (GLOBE NEWSWIRE) -- Tonix Pharmaceuticals Holding Corp. (Nasdaq: TNXP) (Tonix or the Company), today announced that the U.S. Food and Drug Administration (FDA) has accepted the filing of its New Drug Application (NDA)...","link":"https:\/\/www.drugs.com\/nda\/tnx_102_241217.html","pubDate":"Tue, 17 Dec 2024 01:12:06 +0000","feedLabel":"New Drug Applications"},{"title":"Merck Provides Update on KeyVibe and KEYFORM Clinical Development Programs Evaluating Investigational Vibostolimab and Favezelimab Fixed-Dose Combinations with Pembrolizumab","description":"RAHWAY, N.J.--(BUSINESS WIRE) December 16, 2024 --  Merck (NYSE: MRK), known as MSD outside of the United States and Canada, today announced the discontinuation of the clinical development programs for vibostolimab, an anti-TIGIT antibody, and...","link":"https:\/\/www.drugs.com\/clinical_trials\/merck-provides-update-keyvibe-keyform-clinical-development-programs-evaluating-investigational-21835.html","pubDate":"Mon, 16 Dec 2024 22:12:24 +0000","feedLabel":"Clinical Trials"},{"title":"Findings from Minzasolmin Proof-of-Concept ORCHESTRA Study Shape Next Steps in UCB Parkinson’s Research Program","description":"Brussels, Belgium &ndash; 16 December 2024 -- UCB today announced the ORCHESTRA proof-of-concept study of minzasolmin - an investigational, oral small molecule, alpha-synuclein misfolding inhibitor - developed in partnership with Novartis for early...","link":"https:\/\/www.drugs.com\/clinical_trials\/findings-minzasolmin-proof-concept-orchestra-study-shape-next-steps-ucb-parkinson-s-research-program-21834.html","pubDate":"Mon, 16 Dec 2024 22:12:14 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Approves Vtama (tapinarof) Cream for the Treatment of Atopic Dermatitis in Adults and Children 2 Years of Age and Older","description":"JERSEY CITY, N.J.--(BUSINESS WIRE) December 16, 2024 --  Organon (NYSE: OGN), a global healthcare company with a mission to improve the health of women throughout their lives, today announced that the U.S. Food and Drug Administration (FDA) has...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-vtama-tapinarof-cream-atopic-dermatitis-adults-children-2-years-age-older-6419.html","pubDate":"Mon, 16 Dec 2024 20:12:32 +0000","feedLabel":"New Drug Approvals"},{"title":"Galderma Receives U.S. FDA Approval for Nemluvio (nemolizumab) for Patients with Moderate-to-Severe Atopic Dermatitis","description":"Zug, Switzerland &ndash; December 13, 2024 &ndash; Galderma today announced that the United States (U.S.) Food and Drug Administration (FDA) has approved Nemluvio (nemolizumab) for the treatment of patients 12 years and older with moderate-to-severe...","link":"https:\/\/www.drugs.com\/newdrugs\/galderma-receives-u-s-fda-approval-nemluvio-nemolizumab-patients-moderate-severe-atopic-dermatitis-6418.html","pubDate":"Sun, 15 Dec 2024 22:12:17 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Crenessity (crinecerfont) for the Treatment of Children and Adults with Classic Congenital Adrenal Hyperplasia","description":"SAN DIEGO, Dec. 13, 2024 \/PRNewswire\/ -- Neurocrine Biosciences, Inc. (Nasdaq: NBIX) today announced the U.S. Food and Drug Administration has approved Crenessity (crinecerfont) capsules and oral solution as an adjunctive treatment to glucocorticoid...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-crenessity-crinecerfont-children-adults-classic-congenital-adrenal-hyperplasia-6416.html","pubDate":"Sun, 15 Dec 2024 20:12:54 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Unloxcyt (cosibelimab-ipdl) for the Treatment of Cutaneous Squamous Cell Carcinoma","description":"WALTHAM, Mass., Dec. 13, 2024 (GLOBE NEWSWIRE) -- Checkpoint Therapeutics, Inc. (\"Checkpoint\") (Nasdaq: CKPT), today announced that the U.S. Food and Drug Administration (\"FDA\") has approved Unloxcyt (cosibelimab-ipdl) for the treatment of adults...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-unloxcyt-cosibelimab-ipdl-cutaneous-squamous-cell-carcinoma-6417.html","pubDate":"Fri, 13 Dec 2024 21:12:54 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Revokes Emergency Use Authorization (EUA) for Bebtelovimab for the Treatment of COVID-19","description":"December 13, 2024 -- On December 5, 2024, Lilly requested that the U.S. Food and Drug Administration revoke the Emergency Use Authorization for bebtelovimab since all lots of bebtelovimab manufactured and labeled for use under EUA 111 have expired...","link":"https:\/\/www.drugs.com\/clinical_trials\/fda-revokes-emergency-authorization-eua-bebtelovimab-covid-19-21830.html","pubDate":"Fri, 13 Dec 2024 21:12:25 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Revokes EUA for Sotrovimab for the Treatment of COVID-19","description":"December 13, 2024 -- On November 22, 2024, GSK requested that the U.S. Food and Drug Administration revoke the Emergency Use Authorization for sotrovimab since all lots of sotrovimab manufactured and labeled for use under EUA 100 have expired. At...","link":"https:\/\/www.drugs.com\/clinical_trials\/fda-revokes-eua-sotrovimab-covid-19-21831.html","pubDate":"Fri, 13 Dec 2024 21:12:24 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Revokes EUA for REGEN-COV (casirivimab and imdevimab) for the Treatment of COVID-19","description":"December 13, 2024 -- On November 25, 2024, Regeneron requested that the U.S. Food and Drug Administration revoke the Emergency Use Authorization for REGEN-COV (Casirivimab and Imdevimab) since all lots of REGEN-COV manufactured and labeled for use...","link":"https:\/\/www.drugs.com\/clinical_trials\/fda-revokes-eua-regen-cov-casirivimab-imdevimab-covid-19-21832.html","pubDate":"Fri, 13 Dec 2024 21:12:08 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Revokes EUA for Evusheld (tixagevimab co-packaged with cilgavimab) for the Treatment of COVID-19","description":"December 13, 2024 -- On November 21, 2024, AstraZeneca requested that the U.S. Food and Drug Administration revoke the Emergency Use Authorization for Evusheld (tixagevimab co-packaged with cilgavimab) since all lots of Evusheld distributed under...","link":"https:\/\/www.drugs.com\/clinical_trials\/fda-revokes-eua-evusheld-tixagevimab-co-packaged-cilgavimab-covid-19-21829.html","pubDate":"Fri, 13 Dec 2024 20:12:00 +0000","feedLabel":"Clinical Trials"},{"title":"Tolebrutinib Designated Breakthrough Therapy by the FDA for Non-Relapsing Secondary Progressive Multiple Sclerosis","description":"Paris, December 13, 2024. The US Food and Drug Administration (FDA) has granted Breakthrough Therapy designation to tolebrutinib for the treatment of adults with non-relapsing secondary progressive multiple sclerosis (nrSPMS). This is based on...","link":"https:\/\/www.drugs.com\/clinical_trials\/tolebrutinib-designated-breakthrough-therapy-fda-non-relapsing-secondary-progressive-multiple-21828.html","pubDate":"Fri, 13 Dec 2024 03:12:59 +0000","feedLabel":"Clinical Trials"},{"title":"Vir Biotechnology Receives FDA Breakthrough Therapy Designation and EMA PRIME Designation for Tobevibart and Elebsiran in Chronic Hepatitis Delta","description":"SAN FRANCISCO--(BUSINESS WIRE) December 12, 2024 --  Vir Biotechnology, Inc. (Nasdaq: VIR) today announced that tobevibart and elebsiran have received U.S. Food and Drug Administration (FDA) Breakthrough Therapy designation and European Medicines...","link":"https:\/\/www.drugs.com\/clinical_trials\/vir-biotechnology-receives-fda-breakthrough-therapy-designation-ema-prime-designation-tobevibart-21836.html","pubDate":"Thu, 12 Dec 2024 04:12:43 +0000","feedLabel":"Clinical Trials"},{"title":"Repare Therapeutics Announces Positive Results of the Lunresertib and Camonsertib Combination from the MYTHIC Phase 1 Gynecologic Expansion Clinical Trial","description":"CAMBRIDGE, Mass. &amp; MONTREAL--(BUSINESS WIRE)--Dec. 12, 2024-- Repare Therapeutics Inc. (&ldquo;Repare&rdquo; or the &ldquo;Company&rdquo;) (Nasdaq: RPTX), a leading clinical-stage precision oncology company, today reported positive data from its...","link":"https:\/\/www.drugs.com\/clinical_trials\/repare-therapeutics-announces-positive-results-lunresertib-camonsertib-combination-mythic-phase-1-21827.html","pubDate":"Thu, 12 Dec 2024 03:12:04 +0000","feedLabel":"Clinical Trials"},{"title":"Pilatus Biosciences Inc. Receives Orphan Drug Designation from FDA for PLT012 in Treatment of Liver and Intrahepatic Bile Duct Cancer","description":"December 12, 2024 -- Pilatus Biosciences Inc. is pleased to announce that the U.S. Food and Drug Administration (FDA) has granted Orphan Drug Designation (ODD) to its leading molecule, PLT012, for the treatment of liver and intrahepatic bile duct...","link":"https:\/\/www.drugs.com\/clinical_trials\/pilatus-biosciences-inc-receives-orphan-designation-fda-plt012-liver-intrahepatic-bile-duct-cancer-21826.html","pubDate":"Thu, 12 Dec 2024 00:12:00 +0000","feedLabel":"Clinical Trials"},{"title":"Lilly's Imlunestrant, an Oral SERD, Significantly Improved Progression-Free Survival as Monotherapy and in Combination with Verzenio® (abemaciclib) in Patients with ER+, HER2- Advanced Breast Cancer","description":"INDIANAPOLIS, Dec. 11, 2024 \/PRNewswire\/ -- Eli Lilly and Company (NYSE: LLY) today announced results from the Phase 3 EMBER-3 study of imlunestrant, an investigational, oral selective estrogen receptor degrader (SERD), in patients with estrogen...","link":"https:\/\/www.drugs.com\/clinical_trials\/lilly-s-imlunestrant-oral-serd-significantly-improved-progression-free-survival-monotherapy-21825.html","pubDate":"Wed, 11 Dec 2024 22:12:41 +0000","feedLabel":"Clinical Trials"},{"title":"Corcept Announces Results From Phase 2 Study of Dazucorilant in Patients With Amyotrophic Lateral Sclerosis (ALS)","description":"REDWOOD CITY, Calif.--(BUSINESS WIRE)--Dec. 11, 2024-- Corcept Therapeutics Incorporated (NASDAQ: CORT), a commercial-stage company engaged in the discovery and development of medications to treat severe endocrinologic, oncologic, metabolic, and...","link":"https:\/\/www.drugs.com\/clinical_trials\/corcept-announces-results-phase-2-study-dazucorilant-patients-amyotrophic-lateral-sclerosis-als-21838.html","pubDate":"Wed, 11 Dec 2024 03:12:45 +0000","feedLabel":"Clinical Trials"},{"title":"NIH Study Finds Tecovirimat Was Safe but Did Not Improve Mpox Resolution or Pain","description":"December 10, 2024 -- The antiviral drug tecovirimat did not reduce the time to lesion resolution or have an effect on pain among adults with mild to moderate clade II mpox and a low risk of developing severe disease, according to an interim data...","link":"https:\/\/www.drugs.com\/clinical_trials\/nih-study-finds-tecovirimat-safe-but-did-not-improve-mpox-resolution-pain-21822.html","pubDate":"Tue, 10 Dec 2024 23:12:33 +0000","feedLabel":"Clinical Trials"},{"title":"Acelyrin, Inc. Announces Topline Results From Phase 2b\/3 Study of Izokibep for the Treatment of Uveitis","description":"LOS ANGELES, Dec. 10, 2024 (GLOBE NEWSWIRE) -- ACELYRIN, INC. (Nasdaq: SLRN), a late-stage clinical biopharma company focused on accelerating the development and delivery of transformative medicines in immunology, today announced that its Phase 2b\/3...","link":"https:\/\/www.drugs.com\/clinical_trials\/acelyrin-inc-announces-topline-results-phase-2b-3-study-izokibep-uveitis-21833.html","pubDate":"Tue, 10 Dec 2024 22:12:32 +0000","feedLabel":"Clinical Trials"},{"title":"Novavax Initiates Phase 3 Trial for COVID-19-Influenza Combination and Stand-Alone Influenza","description":"GAITHERSBURG, Md., Dec. 10, 2024. Novavax, Inc., a global company advancing protein-based vaccines with its Matrix-M adjuvant, today announced that the first participants have been dosed in its COVID-19-Influenza Combination (CIC) and stand-alone...","link":"https:\/\/www.drugs.com\/clinical_trials\/novavax-initiates-phase-3-trial-covid-19-influenza-combination-stand-alone-influenza-21821.html","pubDate":"Tue, 10 Dec 2024 22:12:26 +0000","feedLabel":"Clinical Trials"},{"title":"Zealand Pharma Announces First Participant Enrolled in Phase 2b ZUPREME-1 Trial of Petrelintide in People with Overweight or Obesity","description":"Copenhagen, Denmark, December 10, 2024 &ndash; Zealand Pharma A\/S (Nasdaq: ZEAL) (&ldquo;Zealand&rdquo;) (CVR-no. 20045078), a biotechnology company focused on the discovery and development of innovative peptide-based medicines, today announced that...","link":"https:\/\/www.drugs.com\/clinical_trials\/zealand-pharma-announces-first-participant-enrolled-phase-2b-zupreme-1-trial-petrelintide-21842.html","pubDate":"Tue, 10 Dec 2024 02:12:56 +0000","feedLabel":"Clinical Trials"},{"title":"uniQure Announces Alignment with FDA on Key Elements of Accelerated Approval Pathway for AMT-130 in Huntington’s Disease","description":"LEXINGTON, Mass. and AMSTERDAM, Dec. 10, 2024 (GLOBE NEWSWIRE) -- uniQure N.V. (NASDAQ: QURE), a leading gene therapy company advancing transformative therapies for patients with severe medical needs, today announced that the company reached...","link":"https:\/\/www.drugs.com\/clinical_trials\/uniqure-announces-alignment-fda-key-elements-accelerated-approval-pathway-amt-130-huntington-s-21824.html","pubDate":"Tue, 10 Dec 2024 01:12:19 +0000","feedLabel":"Clinical Trials"},{"title":"Chimerix to Submit Dordaviprone for Accelerated Approval to U.S. FDA for Patients with Recurrent H3 K27M-Mutant Diffuse Glioma Before Year-End","description":"DURHAM, N.C., Dec. 09, 2024 (GLOBE NEWSWIRE) -- Chimerix (NASDAQ: CMRX), a biopharmaceutical company whose mission it is to develop medicines that meaningfully improve and extend the lives of patients facing deadly diseases, today announced that...","link":"https:\/\/www.drugs.com\/clinical_trials\/chimerix-submit-dordaviprone-accelerated-approval-u-s-fda-patients-recurrent-h3-k27m-mutant-diffuse-21819.html","pubDate":"Mon, 09 Dec 2024 18:12:57 +0000","feedLabel":"Clinical Trials"},{"title":"Odronextamab ASH Presentations Underscore Impressive Potential in Earlier Lines of Treatment and Additional Types of Lymphoma","description":"TARRYTOWN, N.Y., Dec. 09, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced new and updated data for odronextamab were presented at the 66th American Society of Hematology (ASH) Annual Meeting and Exposition in...","link":"https:\/\/www.drugs.com\/clinical_trials\/odronextamab-ash-presentations-underscore-impressive-potential-earlier-lines-additional-types-21818.html","pubDate":"Mon, 09 Dec 2024 03:12:43 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Approves Simplified Dosing Regimen for Acetadote (N-acetylcysteine for injection)","description":"NASHVILLE, Tenn., Dec. 9, 2024 \/PRNewswire\/ -- Cumberland Pharmaceuticals Inc. (Nasdaq: CPIX), a specialty pharmaceutical company focused on delivering high-quality products to improve patient care, announced today the FDA has approved a...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-simplified-dosing-regimen-acetadote-n-acetylcysteine-6415.html","pubDate":"Mon, 09 Dec 2024 03:12:40 +0000","feedLabel":"New Drug Approvals"},{"title":"Datopotamab Deruxtecan Granted Breakthrough Therapy Designation in US for Patients with Previously Treated Advanced EGFR-Mutated Non-Small Cell Lung Cancer","description":"9 December 2024 -- Datopotamab deruxtecan (Dato-DXd) has been granted Breakthrough Therapy Designation (BTD) in the US for the treatment of adult patients with locally advanced or metastatic epidermal growth factor receptor-mutated (EGFRm) non-small...","link":"https:\/\/www.drugs.com\/clinical_trials\/datopotamab-deruxtecan-granted-breakthrough-therapy-designation-us-patients-previously-treated-21823.html","pubDate":"Mon, 09 Dec 2024 00:12:57 +0000","feedLabel":"Clinical Trials"},{"title":"Merck’s Investigational Zilovertamab Vedotin in Combination With R-CHP Demonstrates Complete Response Rate of 100% at 1.75 mg\/kg Dose in Phase 2 Trial of Previously Untreated Patients With Diffuse Large B-Cell Lymphoma","description":"RAHWAY, N.J.--(BUSINESS WIRE) December 8, 2024 --  Merck (NYSE: MRK), known as MSD outside of the United States and Canada, today announced the first presentation of data from the Phase 2 waveLINE-007 trial evaluating zilovertamab vedotin...","link":"https:\/\/www.drugs.com\/clinical_trials\/merck-s-investigational-zilovertamab-vedotin-combination-r-chp-demonstrates-complete-response-rate-21813.html","pubDate":"Sun, 08 Dec 2024 04:12:04 +0000","feedLabel":"Clinical Trials"},{"title":"Phase 2 Data From the Ongoing Hibiscus Study Shows Promise That Investigational Etavopivat Could Reduce the Incidence of Vaso-occlusive Crises in People With Sickle Cell Disease","description":"PLAINSBORO, N.J., Dec. 7, 2024 \/PRNewswire\/ -- Novo Nordisk today announced 52-week results from the phase 2 part of the ongoing phase 2\/3 HIBISCUS study program of investigational etavopivat in people with sickle cell disease. These results were...","link":"https:\/\/www.drugs.com\/clinical_trials\/phase-2-data-ongoing-hibiscus-study-shows-promise-investigational-etavopivat-could-reduce-incidence-21812.html","pubDate":"Sat, 07 Dec 2024 04:12:44 +0000","feedLabel":"Clinical Trials"},{"title":"Novel Combination of Pozelimab and Cemdisiran (Poze-Cemdi) Achieved Greater Control of Intravascular Hemolysis in Patients with Paroxysmal Nocturnal Hemoglobinuria Compared to Ravulizumab","description":"TARRYTOWN, N.Y., Dec. 07, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced positive updated Phase 3 data of an exploratory cohort from the ACCESS-1 trial investigating its first-in-class pozelimab and...","link":"https:\/\/www.drugs.com\/clinical_trials\/novel-combination-pozelimab-cemdisiran-poze-cemdi-achieved-greater-control-intravascular-hemolysis-21814.html","pubDate":"Sat, 07 Dec 2024 04:12:29 +0000","feedLabel":"Clinical Trials"},{"title":"Rilzabrutinib Demonstrated Significant Patient Benefit in the First Positive Phase 3 Study of a BTK Inhibitor in ITP","description":"Paris, December 7, 2024. Positive results from the pivotal LUNA 3 phase 3 study of rilzabrutinib in adults with persistent or chronic immune thrombocytopenia (ITP), a rare immune-mediated disease, reinforce the efficacy and safety of rilzabrutinib...","link":"https:\/\/www.drugs.com\/clinical_trials\/rilzabrutinib-demonstrated-significant-patient-benefit-first-positive-phase-3-study-btk-inhibitor-21815.html","pubDate":"Sat, 07 Dec 2024 04:12:14 +0000","feedLabel":"Clinical Trials"},{"title":"Xenon Showcases New Long-Term Azetukalner Data from X-TOLE OLE Study","description":"VANCOUVER, British Columbia and BOSTON, Dec. 06, 2024 (GLOBE NEWSWIRE) -- Xenon Pharmaceuticals Inc. (Nasdaq: XENE), a neuroscience-focused biopharmaceutical company dedicated to discovering, developing, and delivering life-changing therapeutics for...","link":"https:\/\/www.drugs.com\/clinical_trials\/xenon-showcases-new-long-term-azetukalner-data-x-tole-ole-study-21809.html","pubDate":"Fri, 06 Dec 2024 22:12:10 +0000","feedLabel":"Clinical Trials"},{"title":"BioAge Labs Announces Discontinuation of STRIDES Phase 2 Clinical Trial Evaluating Azelaprag in Combination with Tirzepatide for the Treatment of Obesity","description":"RICHMOND, Calif., Dec. 06, 2024 (GLOBE NEWSWIRE) -- BioAge Labs (Nasdaq: BIOA) (&ldquo;BioAge&rdquo;, &ldquo;the Company&rdquo;), a clinical-stage biopharmaceutical company developing therapeutic product candidates for metabolic diseases by...","link":"https:\/\/www.drugs.com\/clinical_trials\/bioage-labs-announces-discontinuation-strides-phase-2-clinical-trial-evaluating-azelaprag-21816.html","pubDate":"Fri, 06 Dec 2024 04:12:18 +0000","feedLabel":"Clinical Trials"},{"title":"Imfinzi Approved in the US as First and Only Immunotherapy Regimen for Patients with Limited-Stage Small Cell Lung Cancer","description":"5 December 2024 -- AstraZeneca&rsquo;s Imfinzi (durvalumab) has been approved in the US for the treatment of adult patients with limited-stage small cell lung cancer (LS-SCLC) whose disease has not progressed following concurrent platinum-based...","link":"https:\/\/www.drugs.com\/newdrugs\/imfinzi-approved-us-first-only-immunotherapy-regimen-patients-limited-stage-small-cell-lung-cancer-6414.html","pubDate":"Thu, 05 Dec 2024 22:12:03 +0000","feedLabel":"New Drug Approvals"},{"title":"Groundbreaking Cretostimogene Grenadenorepvec Monotherapy Data Demonstrates Sustained, Durable Complete Responses in High-Risk BCG-Unresponsive Non-Muscle Invasive Bladder Cancer","description":"IRVINE, Calif., Dec. 05, 2024 (GLOBE NEWSWIRE) -- CG Oncology, Inc. (NASDAQ: CGON), a late-stage clinical biopharmaceutical company focused on developing and commercializing a potential backbone bladder-sparing therapeutic for patients with bladder...","link":"https:\/\/www.drugs.com\/clinical_trials\/groundbreaking-cretostimogene-grenadenorepvec-monotherapy-data-demonstrates-sustained-durable-21811.html","pubDate":"Thu, 05 Dec 2024 03:12:12 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Grants Accelerated Approval to Bizengri (zenocutuzumab-zbco) for NRG1+ Pancreatic Adenocarcinoma and NRG1+ Non–Small Cell Lung Cancer","description":"UTRECHT, The Netherlands and CAMBRIDGE, Mass., Dec. 04, 2024 (GLOBE NEWSWIRE) -- Merus N.V. (Nasdaq: MRUS) [Merus, the Company, we, or our], a clinical-stage oncology company developing innovative, full-length, multispecific antibodies (Biclonics...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-grants-accelerated-approval-bizengri-zenocutuzumab-zbco-nrg1-pancreatic-adenocarcinoma-nrg1-non-6413.html","pubDate":"Wed, 04 Dec 2024 23:12:59 +0000","feedLabel":"New Drug Approvals"},{"title":"Phanes Therapeutics’ PT217 Granted Fast Track Designation by the FDA for NEPC","description":"SAN DIEGO, Dec. 4, 2024 \/PRNewswire\/ &mdash; Phanes Therapeutics, Inc. (Phanes), a clinical stage biotech company focused on innovative drug discovery and development in oncology, announced today that the U.S. Food and Drug Administration (FDA) has...","link":"https:\/\/www.drugs.com\/clinical_trials\/phanes-therapeutics-pt217-granted-fast-track-designation-fda-nepc-21806.html","pubDate":"Wed, 04 Dec 2024 23:12:38 +0000","feedLabel":"Clinical Trials"},{"title":"FDA Grants Revascor (Rexlemestrocel-L) Regenerative Medicine Advanced Therapy (RMAT) Designation in Children with Congenital Heart Disease","description":"NEW YORK, Dec. 04, 2024 (GLOBE NEWSWIRE) -- Mesoblast Limited (Nasdaq:MESO; ASX:MSB), global leader in allogeneic cellular medicines for inflammatory diseases, today announced the United States Food and Drug Administration (FDA) has granted its...","link":"https:\/\/www.drugs.com\/clinical_trials\/fda-grants-revascor-rexlemestrocel-l-regenerative-medicine-advanced-therapy-rmat-designation-21808.html","pubDate":"Wed, 04 Dec 2024 21:12:55 +0000","feedLabel":"Clinical Trials"},{"title":"Cytokinetics Announces FDA Acceptance of New Drug Application for Aficamten for the Treatment of Obstructive Hypertrophic Cardiomyopathy","description":"SOUTH SAN FRANCISCO, Calif., Dec. 02, 2024 (GLOBE NEWSWIRE) -- Cytokinetics, Incorporated (Nasdaq: CYTK) today announced that the U.S. Food &amp; Drug Administration (FDA) has accepted the company&rsquo;s New Drug Application (NDA) for aficamten, a...","link":"https:\/\/www.drugs.com\/nda\/aficamten_241202.html","pubDate":"Mon, 02 Dec 2024 22:12:47 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Approves Yesintek (ustekinumab-kfce), a Biosimilar to Stelara","description":"Bengaluru, Karnataka, India, December 01, 2024 -- Biocon Biologics Ltd (BBL), a fully integrated global biosimilars company and subsidiary of Biocon Ltd (BSE code: 532523, NSE: BIOCON), announced today that the U.S. Food and Drug Administration...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-yesintek-ustekinumab-kfce-biosimilar-stelara-6411.html","pubDate":"Sun, 01 Dec 2024 23:12:30 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Rapiblyk (landiolol) for Atrial Fibrillation and Atrial Flutter in the Critical Care Setting","description":"Vienna, -- November 27th 2024 -- AOP Orphan Pharmaceuticals GmbH (AOP Health), based in Vienna, Austria, announced that the U.S. Food and Drug Administration (FDA) has granted regulatory approval for Rapiblyk (landiolol) in the hospital critical...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-rapiblyk-landiolol-atrial-fibrillation-atrial-flutter-critical-care-setting-6410.html","pubDate":"Wed, 27 Nov 2024 19:11:35 +0000","feedLabel":"New Drug Approvals"},{"title":"Applied Therapeutics Receives Complete Response Letter from U.S. FDA Regarding New Drug Application for Govorestat for Classic Galactosemia","description":"NEW YORK, Nov. 27, 2024 (GLOBE NEWSWIRE) -- Applied Therapeutics, Inc. (Nasdaq: APLT), a biopharmaceutical company dedicated to creating transformative treatments for rare disease, today announced that the U.S. Food and Drug Administration (FDA) has...","link":"https:\/\/www.drugs.com\/nda\/govorestat_241127.html","pubDate":"Wed, 27 Nov 2024 02:11:14 +0000","feedLabel":"New Drug Applications"},{"title":"Satsuma Pharmaceuticals and SNBL Receive FDA Acceptance of NDA Resubmission of STS101 for the Acute Treatment of Migraine With or Without Aura","description":"DURHAM, N.C., Nov. 26, 2024 \/PRNewswire\/ -- Satsuma Pharmaceuticals, Inc., a late-stage biopharmaceutical company, and its corporate parent, Shin Nippon Biomedical Laboratories, Ltd. (TSE:2395), are pleased to announce that the U.S. Food and Drug...","link":"https:\/\/www.drugs.com\/nda\/sts101_241126.html","pubDate":"Tue, 26 Nov 2024 01:11:30 +0000","feedLabel":"New Drug Applications"},{"title":"Soleno Therapeutics Announces FDA Extension of Review Period for DCCR (Diazoxide Choline) Extended-Release Tablets in Prader-Willi Syndrome","description":"REDWOOD CITY, Calif., Nov. 26, 2024 (GLOBE NEWSWIRE) -- Soleno Therapeutics, Inc. (&ldquo;Soleno&rdquo;) (NASDAQ: SLNO), a clinical-stage biopharmaceutical company developing novel therapeutics for the treatment of rare diseases, today announced...","link":"https:\/\/www.drugs.com\/nda\/dccr_241126.html","pubDate":"Tue, 26 Nov 2024 01:11:01 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Approves Imkeldi (imatinib) Oral Solution for the Treatment of Certain Forms of Leukemia and Other Cancers","description":"CAMBRIDGE, Mass.-- November 25, 2024 --Shorla Oncology (&lsquo;Shorla&rsquo;), a U.S.-Ireland specialty pharmaceutical company, announced today that the FDA has approved Imkeldi (imatinib) oral solution, the first oral liquid form of imatinib to...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-imkeldi-imatinib-oral-solution-certain-forms-leukemia-other-cancers-6409.html","pubDate":"Mon, 25 Nov 2024 21:11:51 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Attruby (acoramidis) to Reduce Cardiovascular Death and Cardiovascular-Related Hospitalization in Patients with ATTR-CM","description":"PALO ALTO, Calif., Nov. 22, 2024 (GLOBE NEWSWIRE) &mdash; BridgeBio Pharma, Inc. (Nasdaq: BBIO) (BridgeBio or the Company), a new type of biopharmaceutical company focused on genetic diseases, today announced that the U.S. Food and Drug...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-attruby-acoramidis-reduce-cardiovascular-death-cardiovascular-related-hospitalization-6408.html","pubDate":"Fri, 22 Nov 2024 22:11:10 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Grants Accelerated Approval to Ziihera (zanidatamab-hrii) for the Treatment of HER2-Positive Biliary Tract Cancer","description":"DUBLIN, Nov. 20, 2024 \/PRNewswire\/ -- Jazz Pharmaceuticals plc (Nasdaq: JAZZ) today announced the U.S. Food and Drug Administration (FDA) accelerated approval of Ziihera&reg; (zanidatamab-hrii) 50mg\/mL for injection for intravenous use for the...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-grants-accelerated-approval-ziihera-zanidatamab-hrii-her2-positive-biliary-tract-cancer-6407.html","pubDate":"Wed, 20 Nov 2024 02:11:05 +0000","feedLabel":"New Drug Approvals"},{"title":"UCB Receives U.S. FDA Approval for Bimzelx (bimekizumab-bkzx) as the First IL-17A and IL-17F Inhibitor for Adults with Moderate to Severe Hidradenitis Suppurativa","description":"Brussels (Belgium),  November 20, 2024 &ndash; 07:00 (CET) &ndash; UCB, a global biopharmaceutical company, today announced that the U.S. Food and Drug Administration (FDA) has approved Bimzelx&reg; (bimekizumab-bkzx) for the treatment of adults...","link":"https:\/\/www.drugs.com\/newdrugs\/ucb-receives-u-s-fda-approval-bimzelx-bimekizumab-bkzx-first-il-17a-il-17f-inhibitor-adults-6406.html","pubDate":"Wed, 20 Nov 2024 01:11:59 +0000","feedLabel":"New Drug Approvals"},{"title":"Arrowhead Pharmaceuticals Submits New Drug Application to U.S. FDA for Plozasiran for the Treatment of Familial Chylomicronemia Syndrome","description":"PASADENA, Calif.&ndash;(BUSINESS WIRE)&ndash;Nov. 18, 2024&ndash; Arrowhead Pharmaceuticals, Inc. (NASDAQ: ARWR) today announced that it submitted a New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) for investigational...","link":"https:\/\/www.drugs.com\/nda\/plozasiran_241118.html","pubDate":"Mon, 18 Nov 2024 19:11:13 +0000","feedLabel":"New Drug Applications"},{"title":"Aldeyra Therapeutics Announces FDA Acceptance for Review of Reproxalap New Drug Application for the Treatment of Dry Eye Disease","description":"LEXINGTON, Mass.--(BUSINESS WIRE)--Nov. 18, 2024-- Aldeyra Therapeutics, Inc. (Nasdaq: ALDX) (Aldeyra) today announced that the U.S. Food and Drug Administration (FDA) has accepted for review the resubmitted New Drug Application (NDA) for topical...","link":"https:\/\/www.drugs.com\/nda\/reproxalap_241118.html","pubDate":"Mon, 18 Nov 2024 19:11:09 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Approves Revuforj (revumenib) for the Treatment of Adult and Pediatric Patients with Relapsed or Refractory Acute Leukemia with a KMT2A Translocation","description":"WALTHAM, Mass., Nov. 15, 2024 \/PRNewswire\/ -- Syndax Pharmaceuticals (Nasdaq: SNDX) today announced that the U.S. Food and Drug Administration (FDA) has approved Revuforj (revumenib) as the first and only menin inhibitor for the treatment of...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-revuforj-revumenib-adult-pediatric-patients-relapsed-refractory-acute-leukemia-kmt2a-6405.html","pubDate":"Fri, 15 Nov 2024 00:11:44 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Danziten (nilotinib) Tablets, the First and Only Nilotinib With No Mealtime Restrictions","description":"WOBURN, Mass. Nov 14, 2024 &ndash; Azurity Pharmaceuticals announced today that the U.S. Food and Drug Administration (FDA) has approved Danziten, the first and only nilotinib with no mealtime restrictions indicated for adult patients with newly...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-danziten-nilotinib-first-only-nilotinib-no-mealtime-restrictions-6400.html","pubDate":"Thu, 14 Nov 2024 01:11:12 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Kebilidi (eladocagene exuparvovec-tneq) Gene Therapy for the Treatment of AADC Deficiency","description":"WARREN, N.J., Nov. 13, 2024 \/PRNewswire\/ -- PTC Therapeutics, Inc. (NASDAQ: PTCT) announced today the U.S. Food and Drug Administration (FDA) accelerated approval of its gene therapy for the treatment of AADC deficiency, the first-ever gene therapy...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-kebilidi-eladocagene-exuparvovec-tneq-gene-therapy-aadc-deficiency-6404.html","pubDate":"Wed, 13 Nov 2024 02:11:31 +0000","feedLabel":"New Drug Approvals"},{"title":"Abeona Therapeutics Announces FDA Acceptance of BLA Resubmission of Pz-cel for the Treatment of Recessive Dystrophic Epidermolysis Bullosa","description":"CLEVELAND, Nov. 12, 2024 (GLOBE NEWSWIRE) -- Abeona Therapeutics Inc. (Nasdaq: ABEO) today announced that the U.S. Food and Drug Administration (FDA) has accepted for review Abeona&rsquo;s resubmission of its Biologics License Application (BLA) for...","link":"https:\/\/www.drugs.com\/nda\/prademagene_zamikeracel_241112.html","pubDate":"Tue, 12 Nov 2024 20:11:35 +0000","feedLabel":"New Drug Applications"},{"title":"Datopotamab Deruxtecan New BLA Submitted for Accelerated Approval in the US for Patients with Previously Treated Advanced EGFR-Mutated Non-Small Cell Lung Cancer","description":"12 November 2024 -- AstraZeneca and Daiichi Sankyo have submitted a new Biologics License Application (BLA) for accelerated approval in the US for datopotamab deruxtecan (Dato-DXd) for the treatment of adult patients with locally advanced or...","link":"https:\/\/www.drugs.com\/nda\/datopotamab_deruxtecan_241112.html","pubDate":"Tue, 12 Nov 2024 18:11:52 +0000","feedLabel":"New Drug Applications"},{"title":"Unicycive Therapeutics Announces U.S. FDA Acceptance of the New Drug Application (NDA) for Oxylanthanum Carbonate (OLC) for the Treatment of Hyperphosphatemia in Patients with Chronic Kidney Disease on Dialysis","description":"LOS ALTOS, Calif., Nov. 11, 2024 (GLOBE NEWSWIRE) -- Unicycive Therapeutics, Inc. (Nasdaq: UNCY), a clinical-stage biotechnology company developing therapies for patients with kidney disease (the &ldquo;Company&rdquo; or &ldquo;Unicycive&rdquo;)...","link":"https:\/\/www.drugs.com\/nda\/oxylanthanum_carbonate_241111.html","pubDate":"Mon, 11 Nov 2024 03:11:58 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Approves Aucatzyl (obecabtagene autoleucel) for Adults with Relapsed\/Refractory B-Cell Acute Lymphoblastic Leukemia","description":"LONDON, Nov. 08, 2024 (GLOBE NEWSWIRE) -- Autolus Therapeutics plc (Nasdaq: AUTL), an early-commercial stage biopharmaceutical company developing next-generation programmed T cell therapies, today announces the U.S. Food and Drug Administration...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-aucatzyl-obecabtagene-autoleucel-adults-relapsed-refractory-b-cell-acute-lymphoblastic-6403.html","pubDate":"Fri, 08 Nov 2024 21:11:15 +0000","feedLabel":"New Drug Approvals"},{"title":"Dizal Submits New Drug Application to the U.S. FDA for Sunvozertinib in Treating Relapsed or Refractory Non-Small Cell Lung Cancer with EGFR Exon 20 Insertion Mutations","description":"November 8, 2024 &ndash; Dizal (SSE:688192), a biopharmaceutical company committed to developing novel medicines for the treatment of cancer and immunological diseases, announced today the submission of a New Drug Application (NDA) to the U.S. Food...","link":"https:\/\/www.drugs.com\/nda\/sunvozertinib_241108.html","pubDate":"Fri, 08 Nov 2024 03:11:20 +0000","feedLabel":"New Drug Applications"},{"title":"Neurotech Provides Update on BLA for NT-501 as a Treatment for Macular Telangiectasia Type 2 (MacTel)","description":"Cumberland, R.I., November 8, 2024 (BUSINESS WIRE) &ndash; Neurotech Pharmaceuticals, Inc., an innovator in sustained drug delivery for chronic retinal diseases, today announced that the U.S. Food and Drug Administration (FDA), has extended the...","link":"https:\/\/www.drugs.com\/nda\/nt_501_241108.html","pubDate":"Fri, 08 Nov 2024 01:11:54 +0000","feedLabel":"New Drug Applications"},{"title":"Merus Receives FDA Extension of PDUFA for Zenocutuzumab","description":"UTRECHT, The Netherlands and CAMBRIDGE, Mass., Nov. 05, 2024 (GLOBE NEWSWIRE) -- Merus N.V. (Nasdaq: MRUS) (Merus, the Company, we, or our), a clinical-stage oncology company developing innovative, full-length multispecific antibodies...","link":"https:\/\/www.drugs.com\/nda\/zenocutuzumab_241105.html","pubDate":"Tue, 05 Nov 2024 01:11:36 +0000","feedLabel":"New Drug Applications"},{"title":"Ionis Announces FDA Acceptance of New Drug Application for Donidalorsen for Prophylactic Treatment of HAE","description":"CARLSBAD, Calif., Nov. 4, 2024 \/PRNewswire\/ -- Ionis Pharmaceuticals, Inc. (Nasdaq: IONS) announced today that the U.S. Food and Drug Administration (FDA) has accepted for review the New Drug Application (NDA) for donidalorsen, an investigational...","link":"https:\/\/www.drugs.com\/nda\/donidalorsen_241104.html","pubDate":"Mon, 04 Nov 2024 23:11:42 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Approves Emrosi (minocycline hydrochloride) for the Treatment of Rosacea","description":"SCOTTSDALE, Ariz., Nov. 04, 2024 (GLOBE NEWSWIRE) -- Journey Medical Corporation (Nasdaq: DERM) (&ldquo;Journey Medical&rdquo;), a commercial-stage pharmaceutical company that primarily focuses on selling and marketing U.S. Food and Drug...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-emrosi-minocycline-hydrochloride-rosacea-6402.html","pubDate":"Mon, 04 Nov 2024 00:11:22 +0000","feedLabel":"New Drug Approvals"},{"title":"Lexicon Announces Outcome of FDA Advisory Committee for Zynquista (sotagliflozin) as an Adjunct to Insulin Therapy for Glycemic Control in Adults with Type 1 Diabetes and Chronic Kidney Disease","description":"THE WOODLANDS, Texas, October 31, 2024 -- Lexicon Pharmaceuticals, Inc. (Nasdaq: LXRX) today announced the outcome of the U.S. Food and Drug Administration (FDA) Endocrinologic and Metabolic Drugs Advisory Committee (EMDAC) Meeting to review the...","link":"https:\/\/www.drugs.com\/nda\/zynquista_241031.html","pubDate":"Thu, 31 Oct 2024 21:10:39 +0000","feedLabel":"New Drug Applications"},{"title":"Verastem Oncology Completes Rolling NDA Submission to the FDA for Avutometinib Plus Defactinib as a Treatment for Recurrent KRAS Mutant Low-Grade Serous Ovarian Cancer","description":"BOSTON--(BUSINESS WIRE)--Oct. 31, 2024-- Verastem Oncology (Nasdaq: VSTM), a biopharmaceutical company committed to advancing new medicines for patients with cancer, today announced that the Company has completed its rolling New Drug Application...","link":"https:\/\/www.drugs.com\/nda\/avutometinib_241031.html","pubDate":"Thu, 31 Oct 2024 03:10:54 +0000","feedLabel":"New Drug Applications"},{"title":"PTC Therapeutics Announces FDA Acceptance of Translarna NDA Resubmission","description":"WARREN, N.J., Oct. 30, 2024 \/PRNewswire\/ -- PTC Therapeutics, Inc. (NASDAQ: PTCT) announced today the U.S. Food and Drug Administration (FDA) has accepted for review the resubmission of the New Drug Application (NDA) for Translarna&trade; (ataluren)...","link":"https:\/\/www.drugs.com\/nda\/translarna_241030.html","pubDate":"Wed, 30 Oct 2024 05:10:26 +0000","feedLabel":"New Drug Applications"},{"title":"Satsuma Pharmaceuticals and SNBL Resubmits the New Drug Application for STS101 (Dihydroergotamine Nasal Powder) for the Acute Treatment of Migraine With or Without Aura","description":"DURHAM, N.C., Oct. 30, 2024 \/PRNewswire\/ -- Satsuma Pharmaceuticals, Inc., a late-stage biopharmaceutical company, and its corporate parent, Shin Nippon Biomedical Laboratories, Ltd. (TSE:2395), today announced the resubmission of the new drug...","link":"https:\/\/www.drugs.com\/nda\/sts101_241030.html","pubDate":"Wed, 30 Oct 2024 03:10:02 +0000","feedLabel":"New Drug Applications"},{"title":"Abeona Therapeutics Completes Pz-cel Biologics License Application Resubmission to U.S. Food and Drug Administration","description":"CLEVELAND, Oct. 29, 2024 (GLOBE NEWSWIRE) -- Abeona Therapeutics Inc. (Nasdaq: ABEO) today announced that the Company has resubmitted its Biologics License Application (BLA) to the U.S. Food and Drug Administration (FDA or Agency) for prademagene...","link":"https:\/\/www.drugs.com\/nda\/prademagene_zamikeracel_241029.html","pubDate":"Tue, 29 Oct 2024 22:10:43 +0000","feedLabel":"New Drug Applications"},{"title":"Shorla Oncology Announces U.S. FDA Expanded Approval of Jylamvo (methotrexate), an Oncology and Autoimmune Drug for Pediatric Indications","description":"CAMBRIDGE, Mass.--(BUSINESS WIRE) October 29, 2024 --Shorla Oncology (&lsquo;Shorla&rsquo;), a U.S.-Ireland specialty pharmaceutical company, announced today that the U.S. Food and Drug Administration (FDA) has expanded the approval of Jylamvo...","link":"https:\/\/www.drugs.com\/newdrugs\/shorla-oncology-announces-u-s-fda-expanded-approval-jylamvo-methotrexate-oncology-autoimmune-6399.html","pubDate":"Tue, 29 Oct 2024 10:10:59 +0000","feedLabel":"New Drug Approvals"},{"title":"Novartis Scemblix Granted FDA Accelerated Approval in Newly Diagnosed CML","description":"East Hanover, October 29, 2024 &ndash; Novartis announced today that Scemblix (asciminib) was granted accelerated approval by the US Food and Drug Administration (FDA) for adult patients with newly diagnosed Philadelphia chromosome-positive chronic...","link":"https:\/\/www.drugs.com\/newdrugs\/novartis-scemblix-granted-fda-accelerated-approval-newly-diagnosed-cml-6401.html","pubDate":"Tue, 29 Oct 2024 10:10:44 +0000","feedLabel":"New Drug Approvals"},{"title":"Protega Pharmaceuticals Receives FDA Approval for RoxyBond (oxycodone hydrochloride) Immediate-Release 10 mg Tablet with Abuse-Deterrent Technology for Management of Pain","description":"PRINCETON, N.J., Oct. 29, 2024 \/PRNewswire\/ -- Protega Pharmaceuticals Inc., an innovative specialty pharmaceutical company focused on responsible pain management and the development of novel abuse-deterrent products, announced today that the U.S...","link":"https:\/\/www.drugs.com\/newdrugs\/protega-pharmaceuticals-receives-fda-approval-roxybond-oxycodone-hydrochloride-immediate-release-10-6398.html","pubDate":"Tue, 29 Oct 2024 09:10:29 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Approves Orlynvah (sulopenem etzadroxil and probenecid) for the Treatment of Uncomplicated Urinary Tract Infections","description":"DUBLIN and CHICAGO, Oct. 25, 2024 (GLOBE NEWSWIRE) -- Iterum Therapeutics plc (Nasdaq: ITRM) (Iterum), today announced that the U.S. Food and Drug Administration (FDA) has approved Iterum&rsquo;s new drug application for Orlynvah (sulopenem...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-orlynvah-sulopenem-etzadroxil-probenecid-uncomplicated-urinary-tract-infections-6397.html","pubDate":"Fri, 25 Oct 2024 21:10:46 +0000","feedLabel":"New Drug Approvals"},{"title":"FDA Accepts New Drug Application and Grants Priority Review for TLX101-CDx (Pixclara®) Brain Cancer Imaging Agent","description":"Melbourne (Australia) | 24 October 2024 -- Telix today announces that the United States (U.S.) Food and Drug Administration (FDA) has accepted the New Drug Application (NDA) for TLX101-CDx (Pixclara&reg;[1]), an agent for the imaging of glioma. The...","link":"https:\/\/www.drugs.com\/nda\/pixclara_241024.html","pubDate":"Thu, 24 Oct 2024 03:10:06 +0000","feedLabel":"New Drug Applications"},{"title":"Camurus Provides Regulatory Update on the US NDA for CAM2029 in Acromegaly","description":"Lund, Sweden &mdash; 22 October 2024 &mdash; Camurus (NASDAQ STO: CAMX) today announced that the U.S. Food and Drug Administration (FDA) has issued a complete response letter (CRL) regarding the new drug application (NDA) for CAM2029 (octreotide)...","link":"https:\/\/www.drugs.com\/nda\/cam2029_241022.html","pubDate":"Tue, 22 Oct 2024 20:10:27 +0000","feedLabel":"New Drug Applications"},{"title":"U.S. FDA Approves Pfizer’s RSV Vaccine Abrysvo for Adults Aged 18 to 59 at Increased Risk for Disease","description":"NEW YORK--(BUSINESS WIRE) October 22, 2024 -- Pfizer Inc. (NYSE: PFE) announced today that the U.S. Food and Drug Administration (FDA) has approved Abrysvo (Respiratory Syncytial Virus Vaccine), the company&rsquo;s bivalent RSV prefusion F (RSVpreF)...","link":"https:\/\/www.drugs.com\/newdrugs\/u-s-fda-approves-pfizer-s-rsv-vaccine-abrysvo-adults-aged-18-59-increased-risk-6395.html","pubDate":"Tue, 22 Oct 2024 05:10:41 +0000","feedLabel":"New Drug Approvals"},{"title":"Alvotech and Teva Announce U.S. FDA Approval of Additional Presentation of Selarsdi (ustekinumab-aekn), Expanding its Label to Include Further Indications Approved for Reference Product, Stelara (ustekinumab)","description":"REYKJAVIK, Iceland &amp; PARSIPPANY, N.J., Oct. 22, 2024 (GLOBE NEWSWIRE) -- Alvotech (NASDAQ: ALVO) and Teva Pharmaceuticals, a U.S. affiliate of Teva Pharmaceutical Industries Ltd. (NYSE and TASE: TEVA), today announced that the U.S. Food and Drug...","link":"https:\/\/www.drugs.com\/newdrugs\/alvotech-teva-announce-u-s-fda-approval-additional-presentation-selarsdi-ustekinumab-aekn-expanding-6394.html","pubDate":"Tue, 22 Oct 2024 04:10:03 +0000","feedLabel":"New Drug Approvals"},{"title":"Elevar Therapeutics Announces FDA Acceptance of New Drug Application Resubmission for Rivoceranib in Combination with Camrelizumab as a First-line Systemic Treatment for Unresectable Hepatocellular Carcinoma","description":"FORT LEE, NEW JERSEY, Oct. 21, 2024 &ndash; Elevar Therapeutics, Inc., a majority-owned subsidiary of HLB Co., Ltd., today announced the U.S. Food and Drug Administration (FDA) accepted the resubmission of a new drug application (NDA) for its...","link":"https:\/\/www.drugs.com\/nda\/rivoceranib_241021.html","pubDate":"Mon, 21 Oct 2024 05:10:06 +0000","feedLabel":"New Drug Applications"},{"title":"LENZ Therapeutics Announces FDA Acceptance of New Drug Application for LNZ100 for the Treatment of Presbyopia","description":"SAN DIEGO, Oct. 21, 2024 (GLOBE NEWSWIRE) -- LENZ Therapeutics, Inc. (Nasdaq: LENZ or &ldquo;LENZ&rdquo; or the &ldquo;Company&rdquo;), a pre-commercial biopharmaceutical company focused on the development and commercialization of the first and only...","link":"https:\/\/www.drugs.com\/nda\/lnz100_241021.html","pubDate":"Mon, 21 Oct 2024 05:10:04 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Approves Vyloy (zolbetuximab-clzb) for the Treatment of Advanced Gastric and GEJ Cancer","description":"TOKYO, Oct. 18, 2024 \/PRNewswire\/ -- Astellas Pharma Inc. (TSE: 4503, President and CEO: Naoki Okamura, \"Astellas\") today announced that the U.S. Food and Drug Administration (FDA) has approved Vyloy&trade; (zolbetuximab-clzb) in combination with...","link":"https:\/\/www.drugs.com\/newdrugs\/fda-approves-vyloy-zolbetuximab-clzb-advanced-gastric-gej-cancer-6391.html","pubDate":"Mon, 21 Oct 2024 01:10:00 +0000","feedLabel":"New Drug Approvals"},{"title":"Botox Cosmetic (onabotulinumtoxinA) Receives FDA Approval for Moderate to Severe Vertical Bands Connecting the Jaw and Neck (Platysma Bands)","description":"IRVINE, Calif., Oct. 18, 2024 \/PRNewswire\/ -- Today, Allergan Aesthetics, an AbbVie company (NYSE: ABBV), announced the U.S. FDA approval of Botox Cosmetic for temporary improvement in the appearance of moderate to severe vertical bands connecting...","link":"https:\/\/www.drugs.com\/newdrugs\/botox-cosmetic-onabotulinumtoxina-receives-fda-approval-moderate-severe-vertical-bands-connecting-6390.html","pubDate":"Fri, 18 Oct 2024 00:10:37 +0000","feedLabel":"New Drug Approvals"},{"title":"Tonix Pharmaceuticals Announces Submission of the TNX-102 SL New Drug Application (NDA) for Fibromyalgia to the U.S. Food and Drug Administration (FDA)","description":"CHATHAM, N.J., Oct. 16, 2024 (GLOBE NEWSWIRE) -- Tonix Pharmaceuticals Holding Corp. (Nasdaq: TNXP) (Tonix or the Company), today announced the submission of a New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) for TNX-102 SL...","link":"https:\/\/www.drugs.com\/nda\/tnx_102_241016.html","pubDate":"Wed, 16 Oct 2024 04:10:40 +0000","feedLabel":"New Drug Applications"},{"title":"UroGen Announces FDA Acceptance of its New Drug Application for UGN-102","description":"PRINCETON, N.J.--(BUSINESS WIRE)--Oct. 15, 2024-- UroGen Pharma Ltd. (Nasdaq: URGN), a biotech company dedicated to developing and commercializing innovative solutions that treat urothelial and specialty cancers, today announced U.S. Food and Drug...","link":"https:\/\/www.drugs.com\/nda\/ugn_102_241015.html","pubDate":"Tue, 15 Oct 2024 22:10:29 +0000","feedLabel":"New Drug Applications"},{"title":"Stealth BioTherapeutics Announces Positive Vote from FDA Advisory Committee Meeting Supporting Potential Approval of Elamipretide for the Treatment of Barth Syndrome","description":"NEEDHAM, Mass., Oct. 11, 2024 \/PRNewswire\/ &mdash; Stealth BioTherapeutics Inc. (the &ldquo;Company&rdquo; or &ldquo;Stealth&rdquo;), a clinical-stage biotechnology company focused on the discovery, development and commercialization of novel...","link":"https:\/\/www.drugs.com\/nda\/elamipretide_241011.html","pubDate":"Fri, 11 Oct 2024 20:10:49 +0000","feedLabel":"New Drug Applications"},{"title":"U.S. Food and Drug Administration (FDA) Accepts New Drug Application for Elinzanetant","description":"Berlin, October 9, 2024 &ndash; Bayer today announced that the U.S. Food and Drug Administration (FDA) has accepted the company&rsquo;s New Drug Application (NDA) for the investigational compound elinzanetant seeking approval for the treatment of...","link":"https:\/\/www.drugs.com\/nda\/elinzanetant_241009.html","pubDate":"Wed, 09 Oct 2024 02:10:09 +0000","feedLabel":"New Drug Applications"},{"title":"Neuvivo Seeks FDA Approval for Its Breakthrough ALS Treatment NP001","description":"Palo Alto, CA &mdash; October 7, 2024 &mdash; Neuvivo, a late-clinical stage biopharmaceutical company, today announced it submitted a New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) for NP001 (sodium chlorite infusion) to...","link":"https:\/\/www.drugs.com\/nda\/np001_241007.html","pubDate":"Mon, 07 Oct 2024 18:10:21 +0000","feedLabel":"New Drug Applications"},{"title":"Aldeyra Therapeutics Resubmits Reproxalap New Drug Application for the Treatment of Dry Eye Disease","description":"LEXINGTON, Mass.--(BUSINESS WIRE)--Oct. 3, 2024-- Aldeyra Therapeutics, Inc. (Nasdaq: ALDX) (Aldeyra), a biotechnology company devoted to discovering and developing innovative therapies designed to treat immune-mediated and metabolic diseases, today...","link":"https:\/\/www.drugs.com\/nda\/reproxalap_241003.html","pubDate":"Thu, 03 Oct 2024 23:10:16 +0000","feedLabel":"New Drug Applications"},{"title":"PTC Therapeutics Announces FDA Acceptance for Filing of NDA for Sepiapterin for the Treatment of Pediatric and Adult Phenylketonuria Patients","description":"WARREN, N.J., Oct. 1, 2024 \/PRNewswire\/ -- PTC Therapeutics, Inc. (NASDAQ: PTCT) announced today the FDA has accepted for filing the New Drug Application (NDA) of sepiapterin for the treatment of pediatric and adult patients living with...","link":"https:\/\/www.drugs.com\/nda\/sepiapterin_241001.html","pubDate":"Tue, 01 Oct 2024 00:10:15 +0000","feedLabel":"New Drug Applications"},{"title":"AbbVie Submits Biologics License Application to the FDA for Telisotuzumab Vedotin (Teliso-V) in Previously Treated Non-Small Cell Lung Cancer","description":"NORTH CHICAGO, Ill., Sept. 27, 2024 \/PRNewswire\/ -- AbbVie (NYSE: ABBV) today announced submission of a Biologics License Application (BLA) to the U.S. Food and Drug Administration (FDA) for accelerated approval of telisotuzumab vedotin (Teliso-V)...","link":"https:\/\/www.drugs.com\/nda\/teliso_v_240927.html","pubDate":"Fri, 27 Sep 2024 00:09:06 +0000","feedLabel":"New Drug Applications"},{"title":"Elevar Therapeutics Resubmits New Drug Application to FDA for Combination of Camrelizumab plus Rivoceranib as First-Line Treatment Option for Unresectable Hepatocellular Carcinoma Boosted by CARES-310 Leading Overall Survival Analysis","description":"FORT LEE, NEW JERSEY, Sept. 23, 2024 &ndash; Elevar Therapeutics, Inc., a majority-owned subsidiary of HLB Co., Ltd., today announced the resubmission of a New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) for its...","link":"https:\/\/www.drugs.com\/nda\/rivoceranib_240923.html","pubDate":"Mon, 23 Sep 2024 23:09:22 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Accepts LEO Pharma’s Filing of Delgocitinib Cream New Drug Application for the Treatment of Chronic Hand Eczema","description":"MADISON, New Jersey, September 23, 2024 &ndash; LEO Pharma Inc. announced today that the Food and Drug Administration (FDA) has accepted for filing a New Drug Application (NDA) for delgocitinib cream 20 mg\/g (2%) for the treatment of adults with...","link":"https:\/\/www.drugs.com\/nda\/delgocitinib_240923.html","pubDate":"Mon, 23 Sep 2024 23:09:08 +0000","feedLabel":"New Drug Applications"},{"title":"FDA Declines to Approve Vanda's Marketing Application for Tradipitant in Gastroparesis","description":"WASHINGTON, Sept. 19, 2024 \/PRNewswire\/ -- Vanda Pharmaceuticals Inc. (Vanda) (Nasdaq: VNDA) today provided an update on its tradipitant development program.\nOn September 18, 2024, the U.S. Food and Drug Administration (FDA) declined to approve...","link":"https:\/\/www.drugs.com\/nda\/tradipitant_240919.html","pubDate":"Thu, 19 Sep 2024 20:09:37 +0000","feedLabel":"New Drug Applications"},{"title":"Applied Therapeutics Provides Regulatory Update on Govorestat for the Treatment of Classic Galactosemia","description":"NEW YORK, Sept. 18, 2024 (GLOBE NEWSWIRE) --  Applied Therapeutics, Inc. (Nasdaq: APLT), a clinical-stage biopharmaceutical company developing a pipeline of novel drug candidates against validated molecular targets in indications of high unmet...","link":"https:\/\/www.drugs.com\/nda\/govorestat_240918.html","pubDate":"Wed, 18 Sep 2024 22:11:44 +0000","feedLabel":"New Drug Applications"}]}