[
    {
        "title": "Access to Green Space May Help Reduce Kids' Screen Time",
        "description": "SATURDAY, Jan. 11, 2025  -- Want to help your child cut back on their screen time?Make sure you live near parks and other open spaces where they can frolic outside.New research underlines the importance of green space access as an alternative to...",
        "link": "https:\/\/www.drugs.com\/news\/access-green-space-may-help-reduce-kids-screen-time-123239.html",
        "pubDate": "Fri, 10 Jan 2025 20:03:17 +0000"
    },
    {
        "title": "Can Carrots Help Treat Type 2 Diabetes?",
        "description": "FRIDAY, Jan. 10, 2025  -- Munching on carrots may help benefit your health, especially if you live with type 2 diabetes. At least, that is the hope of researchers in Denmark.\"We see carrots as a potential component of future dietary strategies for...",
        "link": "https:\/\/www.drugs.com\/news\/can-carrots-help-type-2-diabetes-123240.html",
        "pubDate": "Fri, 10 Jan 2025 19:30:46 +0000"
    },
    {
        "title": "The Best Ways to Quit Vaping",
        "description": "FRIDAY, Jan. 10, 2025  -- Text-based support programs are one of the best ways to help young people quit vaping, a new evidence review says.These texts offer motivational messages and tips for quitting vaping.“I think it’s clear that this approach he...",
        "link": "https:\/\/www.drugs.com\/news\/best-ways-quit-vaping-123241.html",
        "pubDate": "Fri, 10 Jan 2025 19:05:29 +0000"
    },
    {
        "title": "Job Strain Can Worsen Sleep Longterm, Data Suggests",
        "description": "FRIDAY, Jan. 10, 2025 -- Ever woke in the night with your thoughts racing about work problems, co-worker disputes, or heavy career decisions?\nWell, it&rsquo;s more common than you think.\nJob stress is robbing U.S. workers of the sleep they need...",
        "link": "https:\/\/www.drugs.com\/news\/job-strain-can-worsen-sleep-longterm-data-suggests-123234.html",
        "pubDate": "Fri, 10 Jan 2025 16:01:21 +0000"
    },
    {
        "title": "Can Elderberry Juice Help You Lose Weight?",
        "description": "FRIDAY, Jan. 10, 2025 -- Ozempic? Wegovy? Zepbound?\nHow about elderberry juice?\nElderberry juice might help people lose weight and improve their blood sugar control, a new small-scale study says.\nPeople who drank 12 ounces of elderberry juice...",
        "link": "https:\/\/www.drugs.com\/news\/can-elderberry-juice-help-you-lose-weight-123224.html",
        "pubDate": "Fri, 10 Jan 2025 13:01:16 +0000"
    },
    {
        "title": "Being Told to 'Calm Down,' Other Microaggressions May Raise Risk for Postpartum Hypertension",
        "description": "FRIDAY, Jan. 10, 2025 -- The words &ldquo;calm down&rdquo; are worse than unhelpful -- they actually can increase blood pressure among new mothers of color, a study has found.\nGender-based racism through such microaggressions significantly...",
        "link": "https:\/\/www.drugs.com\/news\/being-told-calm-down-other-microaggressions-may-raise-risk-postpartum-hypertension-123227.html",
        "pubDate": "Fri, 10 Jan 2025 12:01:56 +0000"
    },
    {
        "title": "Can Doctors Estimate Life Expectancy After a Dementia Diagnosis?",
        "description": "FRIDAY, Jan. 10, 2025 -- The clock is running for people who&rsquo;ve been diagnosed with dementia, but the time they have left depends on their age.\nAverage life expectancy for people with dementia is largely based on their age at diagnosis...",
        "link": "https:\/\/www.drugs.com\/news\/can-doctors-estimate-expectancy-after-dementia-diagnosis-123226.html",
        "pubDate": "Fri, 10 Jan 2025 12:01:27 +0000"
    },
    {
        "title": "Childhood Smoking Ups COPD Risk",
        "description": "FRIDAY, Jan. 10, 2025 -- Young teens might think smoking makes them look cool, but it&rsquo;s likely to take their breath away in adulthood, a new study says.\nChildren who start smoking prior to age 15 have a 27% increased risk of developing...",
        "link": "https:\/\/www.drugs.com\/news\/childhood-smoking-ups-copd-risk-123225.html",
        "pubDate": "Fri, 10 Jan 2025 12:01:15 +0000"
    },
    {
        "title": "Avoiding Isolation By Volunteering Offers Mental Health Benefits to Seniors",
        "description": "FRIDAY, Jan. 10, 2025 -- Delivering meals to the infirm. Tutoring a student. Patrolling a city park. Helping out at a local library.\nAll these activities not only serve the community, but also can help seniors avoid depression related to social...",
        "link": "https:\/\/www.drugs.com\/news\/avoiding-isolation-volunteering-offers-mental-health-benefits-seniors-123228.html",
        "pubDate": "Fri, 10 Jan 2025 11:01:28 +0000"
    },
    {
        "title": "Poor Sleep Hurts Work Productivity, Survey Shows",
        "description": "THURSDAY, JAN. 8, 2025 -- Got brain fog? Can't concentrate because you didn't sleep well -- or sleep much at all -- last night?\nTiredness and fatigue from sleep deprivation are common problems, says the National Sleep Foundation (NSF). Inadequate...",
        "link": "https:\/\/www.drugs.com\/news\/poor-sleep-hurts-work-productivity-survey-shows-123212.html",
        "pubDate": "Thu, 09 Jan 2025 16:01:37 +0000"
    },
    {
        "title": "Fitness Matters More Than Weight for Longevity, Study Says",
        "description": "THURSDAY, Jan. 9, 2025 -- When it comes to living a longer life, staying active may matter far more than what the scale says.\nPer the largest study yet on fitness, body weight, and longevity published recently in the British Journal of Sports...",
        "link": "https:\/\/www.drugs.com\/news\/fitness-matters-more-than-weight-longevity-study-says-123213.html",
        "pubDate": "Thu, 09 Jan 2025 14:01:19 +0000"
    },
    {
        "title": "Non-Opioids Can Ease Post-Dental Surgery Pain Better Than Opioids, Study Shows",
        "description": "THURSDAY, Jan. 9, 2025 -- Over-the-counter (OTC) drugs acetaminophen and ibuprofen are better at managing dental pain than opioids.\nPeople who had their wisdom teeth removed got better results from an acetaminophen\/ibuprofen combo than with a...",
        "link": "https:\/\/www.drugs.com\/news\/non-opioids-can-ease-post-dental-surgery-pain-better-than-opioids-study-shows-123205.html",
        "pubDate": "Thu, 09 Jan 2025 13:01:56 +0000"
    },
    {
        "title": "Can Exercise Ease Knee Pain? Here's What the Research Shows",
        "description": "THURSDAY, Jan. 9, 2025 -- Movement is medicine, or so they tell people with knee osteoarthritis -- but are they right?\nA recent evidence review calls into question just how helpful exercise can be for easing the pain of knee...",
        "link": "https:\/\/www.drugs.com\/news\/can-exercise-ease-knee-pain-here-s-research-shows-123206.html",
        "pubDate": "Thu, 09 Jan 2025 13:01:23 +0000"
    },
    {
        "title": "Sauna Misuse May Lead to Heat Stroke, Data Suggests",
        "description": "THURSDAY, Jan. 9, 2025 -- Basking in a sauna can be a nice way to relieve stress or relax muscles following a workout.\nBut soaking too long can increase a person&rsquo;s risk of heat stroke, particularly if they aren&rsquo;t well-hydrated, doctors...",
        "link": "https:\/\/www.drugs.com\/news\/sauna-misuse-may-lead-heat-stroke-data-suggests-123207.html",
        "pubDate": "Thu, 09 Jan 2025 12:01:31 +0000"
    },
    {
        "title": "Exercise Prior to Cancer Diagnosis May Help Slow Disease Progression",
        "description": "THURSDAY, Jan. 9, 2025 -- Exercising now can increase your chances of successfully fighting cancer in the future.\nEven low levels of exercise provided protection against cancer, a new study published Jan. 7 in the British Journal of Sports Medicine...",
        "link": "https:\/\/www.drugs.com\/news\/exercise-prior-cancer-diagnosis-may-help-slow-progression-123208.html",
        "pubDate": "Thu, 09 Jan 2025 12:01:21 +0000"
    },
    {
        "title": "Can AI Help Make IVF More Successful?",
        "description": "THURSDAY, Jan. 9, 2025 -- AI might be able to boost the success rates of in vitro fertilization among hopeful families.\nAn AI program can help doctors analyze ultrasound scans to determine the best timing for a hormone injection associated with egg...",
        "link": "https:\/\/www.drugs.com\/news\/can-ai-help-make-ivf-more-successful-123209.html",
        "pubDate": "Thu, 09 Jan 2025 12:01:11 +0000"
    },
    {
        "title": "Gabapentin Doesn't Increase Fall Risk, Study Suggests",
        "description": "THURSDAY, Jan. 9, 2025 -- A pain-relieving medication might be safer for seniors than first thought.\nA new study published Jan. 7 in the Annals of Internal Medicine says Gabapentin is widely used to help treat chronic pain and nerve pain...",
        "link": "https:\/\/www.drugs.com\/news\/gabapentin-doesn-t-increase-fall-risk-study-suggests-123210.html",
        "pubDate": "Thu, 09 Jan 2025 12:01:02 +0000"
    },
    {
        "title": "The Public Policies That Really Help Prevent Suicide",
        "description": "THURSDAY, Jan. 9, 2024 -- Some of the most effective public policies for suicide prevention aren&rsquo;t crafted with suicide or mental health in mind, a new study says.\nEfforts to increase the minimum wage, prohibit gender discrimination, or...",
        "link": "https:\/\/www.drugs.com\/news\/public-policies-really-help-prevent-suicide-123211.html",
        "pubDate": "Thu, 09 Jan 2025 10:01:31 +0000"
    },
    {
        "title": "Let's Address Tomorrow's Antivax Arguments Today: Pediatrics Expert",
        "description": "WEDNESDAY, Jan. 8, 2025 -- Public health officials must prepare to counter ongoing anti-vaccine sentiment in coming years, argues a leading pediatrician-scientist.\n&ldquo;Antivaccine activism became a major lethal force in America&rdquo; during the...",
        "link": "https:\/\/www.drugs.com\/news\/let-s-address-tomorrow-s-antivax-arguments-today-pediatrics-expert-123195.html",
        "pubDate": "Wed, 08 Jan 2025 19:01:56 +0000"
    },
    {
        "title": "Airport and Aircraft Noise Can Hurt Your Heart",
        "description": "WEDNESDAY, Jan. 8, 2025 -- Folks who live near airports are used to the regular roar of jet airliners taking off and landing.\nBut they likely don&rsquo;t know that all this ruckus could be harming their heart health, a new study says.\nPeople...",
        "link": "https:\/\/www.drugs.com\/news\/airport-aircraft-noise-can-hurt-your-heart-123188.html",
        "pubDate": "Wed, 08 Jan 2025 15:01:13 +0000"
    },
    {
        "title": "Can the Mediterranean Diet Boost Your Memory?",
        "description": "WEDNESDAY, Jan. 8, 2025 -- The Mediterranean diet is renown for its ability to improve heart health and help folks lose weight.\nNow a new rat study says this eating pattern also might provide folks a boost in brain power.\nLab rats fed a...",
        "link": "https:\/\/www.drugs.com\/news\/can-mediterranean-diet-boost-your-memory-123178.html",
        "pubDate": "Wed, 08 Jan 2025 13:01:35 +0000"
    },
    {
        "title": "Sugary Drinks Are To Blame for Millions of Diabetes, Heart Disease Cases Worldwide",
        "description": "WEDNESDAY, Jan. 8, -- Sugar-sweetened drink consumption accounts for more than 2 million new cases of type 2 diabetes, and 1.2 million new cases of heart disease worldwide annually.\nAccording to new research published Jan. 6 in the journal Nature...",
        "link": "https:\/\/www.drugs.com\/news\/sugary-drinks-blame-millions-diabetes-heart-cases-worldwide-123177.html",
        "pubDate": "Wed, 08 Jan 2025 13:01:06 +0000"
    },
    {
        "title": "Morning Coffee Linked to Longer Life, Heart Health Benefits",
        "description": "WEDNESDAY, Jan. 8, 2025 -- For many, coffee is a beloved morning ritual, fueling the day ahead. But what if the time you drink it could influence how long -- and how well -- you live?\nNew research published Jan. 8 in the European Heart Journal...",
        "link": "https:\/\/www.drugs.com\/news\/morning-coffee-linked-longer-heart-health-benefits-123179.html",
        "pubDate": "Wed, 08 Jan 2025 13:01:03 +0000"
    },
    {
        "title": "Diabetes Prevention Program Saves People Money, Study Shows",
        "description": "WEDNESDAY, Jan. 8, 2025 -- Preventing diabetes can be as good for a person&rsquo;s wallet as it is for their health, a new study says.\nPeople participating in a diabetes prevention program saved more than $5,000 in direct medical costs over two...",
        "link": "https:\/\/www.drugs.com\/news\/diabetes-prevention-program-saves-money-study-shows-123180.html",
        "pubDate": "Wed, 08 Jan 2025 12:01:28 +0000"
    },
    {
        "title": "Some GLP-1s Achieve More Weight Loss Than Others: Study",
        "description": "WEDNESDAY, Jan. 8, 2025 -- Three GLP-1 drugs are best at helping obese and overweight people drop weight, including one that hasn&rsquo;t yet been approved for that purpose.\nA new evidence review published in the Annals of Internal Medicine shows...",
        "link": "https:\/\/www.drugs.com\/news\/some-glp-1s-achieve-more-weight-loss-than-others-study-123182.html",
        "pubDate": "Wed, 08 Jan 2025 11:01:49 +0000"
    },
    {
        "title": "Despite Previous Data, Paxlovid May Be Useful for Long Covid After All",
        "description": "WEDNESDAY, Jan. 8, 2024 -- The antiviral pill Paxlovid might help some patients who are suffering from long COVID.\nA five-day course of Paxlovid is known to help limit symptoms and shorten illness in patients during an initial bout of COVID-19...",
        "link": "https:\/\/www.drugs.com\/news\/despite-previous-data-paxlovid-may-useful-long-covid-after-all-123181.html",
        "pubDate": "Wed, 08 Jan 2025 11:01:19 +0000"
    },
    {
        "title": "More Evidence Bolsters the Oral Herpes and Alzheimer’s Link",
        "description": "TUESDAY, Jan. 7, 2025 -- That cold sore on your lip might be painful and unsightly, but it could also be a harbinger of debilitating brain aging.\nThe oral herpes virus appears to be linked with Alzheimer&rsquo;s disease, suggesting that the common...",
        "link": "https:\/\/www.drugs.com\/news\/more-evidence-bolsters-oral-herpes-alzheimer-s-link-123183.html",
        "pubDate": "Wed, 08 Jan 2025 00:01:54 +0000"
    },
    {
        "title": "Health Advocates Are Unhappy with FDA Guidance on Lead Levels in Baby Food",
        "description": "TUESDAY, Jan. 7, 2025 -- The U.S. Food and Drug Association (FDA) released the first-ever guidelines for levels of lead in processed baby foods this week. However, many health and safety advocates say they are not satisfied with the guidance.\nUnder...",
        "link": "https:\/\/www.drugs.com\/news\/health-advocates-unhappy-fda-guidance-lead-levels-baby-food-123175.html",
        "pubDate": "Tue, 07 Jan 2025 18:01:03 +0000"
    },
    {
        "title": "FDA Calls for Better Accuracy of Pulse Oximeters in People of Color",
        "description": "TUESDAY, Jan. 7, 2025 -- Pulse oximeters -- those tiny devices that measure blood oxygen levels with a quick clip to your finger -- may soon get a major upgrade to ensure they work just as well for people of all skin tones.\nThe U.S. Food and Drug...",
        "link": "https:\/\/www.drugs.com\/news\/fda-calls-better-accuracy-pulse-oximeters-color-123176.html",
        "pubDate": "Tue, 07 Jan 2025 17:01:00 +0000"
    },
    {
        "title": "Fluoride May Be Linked to Decreased IQ, Says \"Limited Data,\" Hard-to-Interpret Study",
        "description": "TUESDAY, Jan. 7, 2025 -- Fluoride exposure appears to slightly decrease IQ scores in children, a new federal meta-analysis has concluded -- but not at the low levels recommended for U.S. drinking water.\nFluoride in drinking water was associated...",
        "link": "https:\/\/www.drugs.com\/news\/fluoride-may-linked-decreased-iq-says-limited-data-hard-interpret-study-123163.html",
        "pubDate": "Tue, 07 Jan 2025 16:01:36 +0000"
    },
    {
        "title": "First U.S. Death From Bird Flu Reported in Louisiana",
        "description": "TUESDAY, Jan. 7, 2025 -- A Louisiana resident has died after being hospitalized with bird flu in December of last year, marking the first known U.S. death from the virus.\nThe patient who, \"was over the age of 65 and was reported to have underlying...",
        "link": "https:\/\/www.drugs.com\/news\/first-u-s-death-bird-flu-reported-louisiana-123164.html",
        "pubDate": "Tue, 07 Jan 2025 14:01:03 +0000"
    },
    {
        "title": "Blood Test May Help Predict How Long Immunity Lasts",
        "description": "TUESDAY, Jan. 7, 2024 -- It&rsquo;s long been a mystery why folks need a flu vaccine every year, even though immunizations they got in childhood continue to protect them from measles and mumps.\nResearchers now think they know why vaccine...",
        "link": "https:\/\/www.drugs.com\/news\/blood-test-may-help-predict-long-immunity-lasts-123153.html",
        "pubDate": "Tue, 07 Jan 2025 13:01:09 +0000"
    },
    {
        "title": "Multilingual Children with Autism Show Improved Cognitive Function",
        "description": "TUESDAY, Jan. 7, 2025 -- Kids with autism who speak more than one language tend to have fewer symptoms from their disorder.\nBeing multilingual not only enhances their general cognitive abilities, but also helps them better control their daily...",
        "link": "https:\/\/www.drugs.com\/news\/multilingual-children-autism-show-improved-cognitive-function-123155.html",
        "pubDate": "Tue, 07 Jan 2025 12:01:35 +0000"
    },
    {
        "title": "DoxyPEP Lowers Rate of Sexually Transmitted Infections (STIs), Data Suggests",
        "description": "TUESDAY, Jan. 7, 2025 -- Worried about the risky sex you had last night?\nUsing a common antibiotic following sex can dramatically reduce a person&rsquo;s risk of some sexually transmitted infections (STIs), a new study says.\nTaking doxycycline...",
        "link": "https:\/\/www.drugs.com\/news\/doxypep-lowers-rate-sexually-transmitted-infections-stis-data-suggests-123154.html",
        "pubDate": "Tue, 07 Jan 2025 12:01:20 +0000"
    },
    {
        "title": "Caregivers Face Mental, Physical Health Risks",
        "description": "TUESDAY, Jan. 7, 2025 -- More and more adults are stuck in the middle of their families, caring not only for their children but also for aging parents and other older family members.\nThe mental and physical health of these &ldquo;sandwich...",
        "link": "https:\/\/www.drugs.com\/news\/caregivers-face-mental-physical-health-risks-123157.html",
        "pubDate": "Tue, 07 Jan 2025 11:01:51 +0000"
    },
    {
        "title": "Access to Medical Test Results Is Confusing, Anxiety-Provoking",
        "description": "TUESDAY, Jan. 7, 2025 -- Patients have more access to their own medical test results than ever before, thanks to legislation requiring results be released as soon as they&rsquo;re available.\nBut that&rsquo;s not necessarily a good thing, a new...",
        "link": "https:\/\/www.drugs.com\/news\/access-medical-test-results-confusing-anxiety-provoking-123156.html",
        "pubDate": "Tue, 07 Jan 2025 11:01:13 +0000"
    },
    {
        "title": "Interest In Permanent Contraception Rose After Roe v. Wade was Overturned",
        "description": "TUESDAY, Jan. 7, 2024 -- Abortion bans have led many young people to decide they&rsquo;d rather forego having kids than ever face that dilemma.\nA surge in permanent contraception immediately followed the 2022 Supreme Court decision that overturned...",
        "link": "https:\/\/www.drugs.com\/news\/interest-permanent-contraception-rose-after-roe-v-wade-overturned-123152.html",
        "pubDate": "Mon, 06 Jan 2025 21:01:11 +0000"
    },
    {
        "title": "U.S. Whooping Cough Cases Surge",
        "description": "MONDAY, Jan. 6, 2025 -- Rates of whooping cough in the U.S. continue to climb, according to data from the US Centers for Disease Control (CDC).\nOver 32,000 cases reported have been reported as of mid-December -- about six times more than there were...",
        "link": "https:\/\/www.drugs.com\/news\/u-s-whooping-cough-cases-surge-123146.html",
        "pubDate": "Mon, 06 Jan 2025 18:01:06 +0000"
    },
    {
        "title": "Brain Volume, Health Linked to Socioeconomic Status",
        "description": "MONDAY, Jan. 6, 2025 -- Wealth could be related to brain health, a new study says.\nPeople raised in poorer communities or nations appear to have brains more likely to shrink with age, as well as disrupted connectivity between brain regions related...",
        "link": "https:\/\/www.drugs.com\/news\/brain-volume-health-linked-socioeconomic-status-123139.html",
        "pubDate": "Mon, 06 Jan 2025 14:01:51 +0000"
    },
    {
        "title": "Cruise Passenger Dies Amid Norovirus Outbreak That Sickened Dozens",
        "description": "MONDAY, Jan. 6, 2025 -- A norovirus outbreak aboard the P&amp;O Cruises&rsquo; Arcadia ship last fall left dozens of passengers confined to their cabins and is now linked to the death of a 77-year-old British passenger.\nAlan Forster, a retired...",
        "link": "https:\/\/www.drugs.com\/news\/cruise-passenger-dies-amid-norovirus-outbreak-sickened-dozens-123140.html",
        "pubDate": "Mon, 06 Jan 2025 14:01:07 +0000"
    }
]